erp3l/src/DataProcessors/РаботаСМетаданнымиУХ/РаботаСМетаданнымиУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСМетаданнымиУХ</name>
  <attributes>
    <name>DateFractions</name>
  </attributes>
  <attributes>
    <name>PresentationAdditionType</name>
  </attributes>
  <attributes>
    <name>ComparisonType</name>
  </attributes>
  <attributes>
    <name>AllowedSign</name>
  </attributes>
  <attributes>
    <name>AllowedLength</name>
  </attributes>
  <attributes>
    <name>QueryResultIteration</name>
  </attributes>
  <attributes>
    <name>QueryRecordType</name>
  </attributes>
  <attributes>
    <name>BoundaryType</name>
  </attributes>
  <attributes>
    <name>AccountingRecordType</name>
  </attributes>
  <attributes>
    <name>DocumentWriteMode</name>
  </attributes>
  <attributes>
    <name>FillChecking</name>
  </attributes>
  <attributes>
    <name>Catalogs</name>
  </attributes>
  <attributes>
    <name>Enums</name>
  </attributes>
  <attributes>
    <name>Documents</name>
  </attributes>
  <attributes>
    <name>ChartsOfCharacteristicTypes</name>
  </attributes>
  <attributes>
    <name>ChartsOfAccounts</name>
  </attributes>
  <attributes>
    <name>AccountingRegisters</name>
  </attributes>
  <attributes>
    <name>AccumulationRegisters</name>
  </attributes>
  <attributes>
    <name>InformationRegisters</name>
  </attributes>
  <attributes>
    <name>Metadata</name>
  </attributes>
</mdclass:DataProcessor>

erp3l/src/DataProcessors/РаботаСМетаданнымиУХ/ObjectModule.bsl
Функция NewObject(Тип,
				Параметр1=Неопределено,
				Параметр2=Неопределено,
				Параметр3=Неопределено,
				Параметр4=Неопределено,
				Параметр5=Неопределено) Экспорт 
					
	МассивТипов=Новый Массив;
	
	Если Параметр1<>Неопределено Тогда
		
		МассивТипов.Добавить(Параметр1);
		
	КонецЕсли;
	
	Если Параметр2<>Неопределено Тогда
		
		МассивТипов.Добавить(Параметр2);
		
	КонецЕсли;
	
	Если Параметр3<>Неопределено Тогда
		
		МассивТипов.Добавить(Параметр3);
		
	КонецЕсли;
	
	Если Параметр4<>Неопределено Тогда
		
		МассивТипов.Добавить(Параметр4);
		
	КонецЕсли;
	
	Если Параметр5<>Неопределено Тогда
		
		МассивТипов.Добавить(Параметр5);
		
	КонецЕсли;
		
	Возврат ?(МассивТипов.Количество()=0,Новый(Тип),Новый(Тип,МассивТипов));
			
КонецФункции // NewObject()

#Область СистемныеПеречисления

ЭтотОбъект.DateFractions=Новый Структура;
ЭтотОбъект.DateFractions.Вставить("Time",		ЧастиДаты.Время);
ЭтотОбъект.DateFractions.Вставить("Date",		ЧастиДаты.Дата);
ЭтотОбъект.DateFractions.Вставить("DateTime",	ЧастиДаты.ДатаВремя);

ЭтотОбъект.PresentationAdditionType=Новый Структура;
ЭтотОбъект.PresentationAdditionType.Вставить("Add",		ТипДобавленияПредставлений.Добавлять);
ЭтотОбъект.PresentationAdditionType.Вставить("DontAdd",	ТипДобавленияПредставлений.НеДобавлять);

ЭтотОбъект.ComparisonType=Новый Структура;
ЭтотОбъект.ComparisonType.Вставить("Greater",						ВидСравнения.Больше);
ЭтотОбъект.ComparisonType.Вставить("GreaterOrEqual",				ВидСравнения.БольшеИлиРавно);
ЭтотОбъект.ComparisonType.Вставить("InHierarchy",					ВидСравнения.ВИерархии);
ЭтотОбъект.ComparisonType.Вставить("InList",						ВидСравнения.ВСписке);
ЭтотОбъект.ComparisonType.Вставить("InListByHierarchy",				ВидСравнения.ВСпискеПоИерархии);
ЭтотОбъект.ComparisonType.Вставить("Interval",						ВидСравнения.Интервал);
ЭтотОбъект.ComparisonType.Вставить("IntervalIncludingBounds",		ВидСравнения.ИнтервалВключаяГраницы);
ЭтотОбъект.ComparisonType.Вставить("IntervalIncludingLowerBound",	ВидСравнения.ИнтервалВключаяНачало);
ЭтотОбъект.ComparisonType.Вставить("IntervalIncludingUpperBound",	ВидСравнения.ИнтервалВключаяОкончание);
ЭтотОбъект.ComparisonType.Вставить("Less",							ВидСравнения.Меньше);
ЭтотОбъект.ComparisonType.Вставить("LessOrEqual",					ВидСравнения.МеньшеИлиРавно);
ЭтотОбъект.ComparisonType.Вставить("NotInHierarchy",				ВидСравнения.НеВИерархии);
ЭтотОбъект.ComparisonType.Вставить("NotInList",						ВидСравнения.НеВСписке);
ЭтотОбъект.ComparisonType.Вставить("NotInListByHierarchy",			ВидСравнения.НеВСпискеПоИерархии);
ЭтотОбъект.ComparisonType.Вставить("NotEqual",						ВидСравнения.НеРавно);
ЭтотОбъект.ComparisonType.Вставить("NotContains",					ВидСравнения.НеСодержит);
ЭтотОбъект.ComparisonType.Вставить("Equal",							ВидСравнения.Равно);
ЭтотОбъект.ComparisonType.Вставить("Contains",						ВидСравнения.Содержит);

ЭтотОбъект.AllowedSign=Новый Структура;
ЭтотОбъект.AllowedSign.Вставить("Any",			ДопустимыйЗнак.Любой);
ЭтотОбъект.AllowedSign.Вставить("Nonnegative",	ДопустимыйЗнак.Неотрицательный);

ЭтотОбъект.AllowedLength=Новый Структура;
ЭтотОбъект.AllowedLength.Вставить("Variable",	ДопустимаяДлина.Переменная);
ЭтотОбъект.AllowedLength.Вставить("Fixed",		ДопустимаяДлина.Фиксированная);

ЭтотОбъект.Catalogs						= Справочники;
ЭтотОбъект.Enums						= Перечисления;
ЭтотОбъект.Documents					= Документы;
ЭтотОбъект.ChartsOfCharacteristicTypes	= ПланыВидовХарактеристик;
ЭтотОбъект.ChartsOfAccounts				= ПланыСчетов;
ЭтотОбъект.AccountingRegisters			= РегистрыБухгалтерии;
ЭтотОбъект.AccumulationRegisters		= РегистрыНакопления;
ЭтотОбъект.InformationRegisters			= РегистрыСведений;

ЭтотОбъект.Metadata=Новый Структура;
ЭтотОбъект.Metadata.Вставить("Catalogs",					Метаданные.Справочники);
ЭтотОбъект.Metadata.Вставить("ChartsOfCharacteristicTypes",	Метаданные.ПланыВидовХарактеристик);
ЭтотОбъект.Metadata.Вставить("Documents",					Метаданные.Документы);
ЭтотОбъект.Metadata.Вставить("Enums",						Метаданные.Перечисления);
ЭтотОбъект.Metadata.Вставить("ChartsOfAccounts",			Метаданные.ПланыСчетов);
ЭтотОбъект.Metadata.Вставить("ObjectProperties",			Метаданные.СвойстваОбъектов);
ЭтотОбъект.Metadata.Вставить("CommonAttributes",			Метаданные.ОбщиеРеквизиты);
ЭтотОбъект.Metadata.Вставить("AccountingRegisters",			Метаданные.РегистрыБухгалтерии);
ЭтотОбъект.Metadata.Вставить("AccumulationRegisters",		Метаданные.РегистрыНакопления);
ЭтотОбъект.Metadata.Вставить("InformationRegisters",		Метаданные.РегистрыСведений);

ЭтотОбъект.QueryResultIteration=Новый Структура;
ЭтотОбъект.QueryResultIteration.Вставить("ByGroups",					ОбходРезультатаЗапроса.ПоГруппировкам);
ЭтотОбъект.QueryResultIteration.Вставить("ByGroupsWithHierarchy ",		ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
ЭтотОбъект.QueryResultIteration.Вставить("Linear ",						ОбходРезультатаЗапроса.Прямой);

ЭтотОбъект.QueryRecordType=Новый Структура;
ЭтотОбъект.QueryRecordType.Вставить("DetailRecord",		ТипЗаписиЗапроса.ДетальнаяЗапись);
ЭтотОбъект.QueryRecordType.Вставить("GroupTotal",		ТипЗаписиЗапроса.ИтогПоГруппировке);
ЭтотОбъект.QueryRecordType.Вставить("TotalByHierarchy",	ТипЗаписиЗапроса.ИтогПоИерархии);
ЭтотОбъект.QueryRecordType.Вставить("Overall",			ТипЗаписиЗапроса.ОбщийИтог);

ЭтотОбъект.BoundaryType=Новый Структура;
ЭтотОбъект.BoundaryType.Вставить("Including",ВидГраницы.Включая);
ЭтотОбъект.BoundaryType.Вставить("Excluding",ВидГраницы.Исключая);

ЭтотОбъект.AccountingRecordType=Новый Структура;
ЭтотОбъект.AccountingRecordType.Вставить("Debit",	ВидДвиженияБухгалтерии.Дебет);
ЭтотОбъект.AccountingRecordType.Вставить("Credit",	ВидДвиженияБухгалтерии.Кредит);

ЭтотОбъект.DocumentWriteMode=Новый Структура;
ЭтотОбъект.DocumentWriteMode.Вставить("Write",		РежимЗаписиДокумента.Запись);
ЭтотОбъект.DocumentWriteMode.Вставить("UndoPosting",РежимЗаписиДокумента.ОтменаПроведения);
ЭтотОбъект.DocumentWriteMode.Вставить("Posting",	РежимЗаписиДокумента.Проведение);

ЭтотОбъект.FillChecking=Новый Структура;
ЭтотОбъект.FillChecking.Вставить("ShowError",ПроверкаЗаполнения.ВыдаватьОшибку);
ЭтотОбъект.FillChecking.Вставить("DontCheck",ПроверкаЗаполнения.НеПроверять);















#КонецОбласти
